Tekla Open API Reference for Tekla Structures 2025
LeaderLine.Insert Method
 A leader line cannot be inserted.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Insert()
Public Overrides Function Insert As Boolean
Return Value
Type: Boolean
An exception.
See Also
Reference
LeaderLine Class
Tekla.Structures.Drawing Namespace